ssenja/TMM737/BSP/GD32H7xx_HAL/SRC/gd32h73x_75x_sai.c
/*!
    \file    gd32h73x_75x_sai.c
    \brief   SAI driver

    \version 2026-03-24, V1.6.0, firmware for GD32H73x_75x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h73x_75x_sai.h"

/* SAI pdm mode microphone delay mask */
#define PDM_MICROPHONE_DELAY_MASK            ((uint32_t)0x00000007U)
/*!< bit offset of MTFCNT in SAI_CFG1 */
#define CFG1_MTFCNT_OFFSET                   ((uint32_t)0x00000007U)

/*!
    \brief      reset SAI
    \param[in]  sai_periph: SAIx(x = 0,1,2)
    \param[out] none
    \retval     none
*/
void sai_deinit(uint32_t sai_periph)
{
    switch(sai_periph) {
        case SAI0:
            /* reset SAI0 */
            rcu_periph_reset_enable(RCU_SAI0RST);
            rcu_periph_reset_disable(RCU_SAI0RST);
            break;
        case SAI1:
            /* reset SAI1 */
            rcu_periph_reset_enable(RCU_SAI1RST);
            rcu_periph_reset_disable(RCU_SAI1RST);
            break;
        case SAI2:
            /* reset SAI2 */
            rcu_periph_reset_enable(RCU_SAI2RST);
            rcu_periph_reset_disable(RCU_SAI2RST);
            break;
        default:
            break;
    }
}

/*!
    \brief      initialize the parameter of SAI structure with a default value
    \param[in]  none
    \param[out] sai_init_struct: the initialization data needed to initialize SAI
    \retval     none
*/
void sai_struct_para_init(sai_parameter_struct *sai_init_struct)
{
    /* initialize the initpara struct member with the default value */
    sai_init_struct->operating_mode         = SAI_MASTER_TRANSMITTER;
    sai_init_struct->protocol               = SAI_PROTOCOL_POLYMORPHIC;
    sai_init_struct->data_width             = SAI_DATAWIDTH_32BIT;
    sai_init_struct->shift_dir              = SAI_SHIFT_MSB;
    sai_init_struct->sample_edge            = SAI_SAMPEDGE_FALLING;
    sai_init_struct->sync_mode              = SAI_SYNCMODE_ASYNC;
    sai_init_struct->output_drive           = SAI_OUTPUT_WITH_SAIEN;
    sai_init_struct->clk_div_bypass         = SAI_CLKDIV_BYPASS_OFF;
    sai_init_struct->mclk_div               = SAI_MCLKDIV_1;
    sai_init_struct->mclk_oversampling      = SAI_MCLK_OVERSAMP_256;
    sai_init_struct->mclk_enable            = SAI_MCLK_DISABLE;
    sai_init_struct->fifo_threshold         = SAI_FIFOTH_EMPTY;
}

/*!
    \brief      initialize the parameter of SAI frame structure with a default value
    \param[in]  none
    \param[out] sai_frame_init_struct: the initialization data needed to initialize SAI frame
    \retval     none
*/
void sai_frame_struct_para_init(sai_frame_parameter_struct *sai_frame_init_struct)
{
    /* initialize the initpara struct member with the default value */
    sai_frame_init_struct->frame_width                = 256U;
    sai_frame_init_struct->frame_sync_width           = 128U;
    sai_frame_init_struct->frame_sync_function        = SAI_FS_FUNC_START;
    sai_frame_init_struct->frame_sync_polarity        = SAI_FS_POLARITY_LOW;
    sai_frame_init_struct->frame_sync_offset          = SAI_FS_OFFSET_BEGINNING;
}

/*!
    \brief      initialize the parameter of SAI slot structure with a default value
    \param[in]  none
    \param[out] sai_slot_init_struct: the initialization data needed to initialize SAI slot
    \retval     none
*/
void sai_slot_struct_para_init(sai_slot_parameter_struct *sai_slot_init_struct)
{
    /* initialize the initpara struct member with the default value */
    sai_slot_init_struct->slot_number            = 16U;
    sai_slot_init_struct->slot_width             = SAI_SLOT_WIDTH_DATA;
    sai_slot_init_struct->data_offset            = 0U;
    sai_slot_init_struct->slot_active            = SAI_SLOT_ACTIVE_NONE;
}

/*!
    \brief      initialize SAI
    \param[in]  sai_periph: SAIx(x=0,1,2)
    \param[in]  block: specify which bolck is initialized
                only one parameter can be selected which is shown as below:
      \arg        SAI_BLOCKx(x = 0,1)
    \param[in]  sai_struct: SAI parameter initialization stuct members of the structure
                            and the member values are shown as below:
                    operating_mode: SAI_MASTER_TRANSMITTER, SAI_MASTER_RECEIVER, SAI_SLAVE_TRANSMITTER, SAI_SLAVE_RECEIVER;
                    protocol: SAI_PROTOCOL_POLYMORPHIC, SAI_PROTOCOL_SPDIF, SAI_PROTOCOL_AC97
                    data_width: SAI_DATA_WIDTH_xBIT (x = 8, 10, 16, 20, 24, 32)
                    shift_dir: SAI_SHIFT_MSB, SAI_SHIFT_LSB
                    sample_edge: SAI_SAMPEDGE_FALLING, SAI_SAMPEDGE_RISING
                    sync_mode: SAI_SYNCMODE_ASYNC, SAI_SYNCMODE_OTHERBLOCK, SAI_SYNCMODE_EXTERNALSAI
                    output_drive: SAI_OUTPUT_WITH_SAIEN, SAI_OUTPUT_NOW
                    clk_div_bypass: SAI_CLKDIV_BYPASS_OFF, SAI_CLKDIV_BYPASS_ON
                    mck_div: SAI_MCLKDIV_x (x = 1,2,..,63)
                    mck_oversampling: SAI_MASTERCLK_OVERSAMP_256, SAI_MASTERCLK_OVERSAMP_512
                    mck_enable: SAI_MASTERCLK_DISABLE, SAI_MASTERCLK_ENABLE
                    fifo_threshold: SAI_FIFOTH_EMPTY, SAI_FIFOTH_QUARTER, SAI_FIFOTH_HALF, SAI_FIFOTH_THREE_QUARTER, SAI_FIFOTH_FULL
    \param[out] none
    \retval     none
*/
void sai_init(uint32_t sai_periph, uint32_t block, sai_parameter_struct *sai_struct)
{
    uint32_t reg = 0U;

    /* configure the SAI CFGR0 value */
    reg = SAI_CFG0(sai_periph, block);
    reg &= ~(SAI_CFG0_OPTMOD | SAI_CFG0_PROT | \
             SAI_CFG0_DATAWD | SAI_CFG0_SHIFTDIR | \
             SAI_CFG0_SAMPEDGE | SAI_CFG0_SYNCMOD | \
             SAI_CFG0_ODRIV | SAI_CFG0_BYPASS | \
             SAI_CFG0_MDIV | SAI_CFG0_MOSPR | \
             SAI_CFG0_MCLKEN | SAI_CFG0_SAIEN);

    reg |= (uint32_t)(sai_struct->operating_mode | sai_struct->protocol | \
                      sai_struct->data_width | sai_struct->shift_dir | \
                      sai_struct->sample_edge | sai_struct->sync_mode | \
                      sai_struct->output_drive | sai_struct->clk_div_bypass | \
                      sai_struct->mclk_div | sai_struct->mclk_oversampling | \
                      sai_struct->mclk_enable);
    SAI_CFG0(sai_periph, block) = reg;

